{
  "jsQuestions": [
    { 
      "title": "Write A Function",
      "question": ""
    },
    {
      "title": "Add to Front",
      "question": "Given an array and an element, the function 'addToFront' adds the given element to the front of the given array, and returns the given array."
    },
    {
      "title": "Add Object Property",
      "question": "Given two objects and a key, the function 'addObjectProperty' sets a new property on the 1st object at the given key. The value of that new property is the entire 2nd object."
    },
    {
      "title": "Join Arrays of Arrays",
      "question": "Given an array of arrays, the function 'joinArrayOfArrays' returns a single array containing the elements of the nested arrays."
    },
    {
      "title": "Count Characters in a String",
      "question": "Given a string input and a character, the function 'countCharacter' returns the number of occurrences of a given character in the given string."
    },
    {
      "title": "Square All Elements in an Array",
      "question": "Given a array of numbers, the function 'squareElements' should return a new array where each element is the square of the element of the given array."
    },
    {
      "title": "Get the Length of Two Words",
      "question": "Given 2 words, the function 'getLengthOfTwoWords' returns the sum of their lengths."
    },
    {
      "title": "Get All Elements But the Nth",
      "question": "Given an array and an index, the function 'getAllElementsButNth' returns an array with all the elements but the nth."
    },
    {
      "title": "Extend",
      "question": "Given two objects, 'extend' adds properties from the 2nd object to the 1st object."
    },
    {
      "title": "Repeat String",
      "question": "Given a string and a number, the function 'repeatString' returns the given string repeated the given number of times."
    }
  ],
  "htmlQuestions": [{
    "title": "Titles with h1",
    "question": "Using an h1 element write 'My first HTML title'"
  },
  {
    "title": "Link To JQuery",
    "question": "Use script tags to link to the jQuery CDN.  Here is the address for the jQuery CDN: 'jquery-3.3.1.min.js'... hint! hint! use the src attribute to link the libary"
  },
  {
    "title": "Add an HTML Link",
    "question": "Using an a element add a link to 'https://think-programming-client.herokuapp.com'. make the links text say 'Think Programming' and use the href attribute inside of the a tags."
  },
  {
  "title": "Adding a class to an HTML element",
    "question": "Make an h2 element with a class of 'think-programming-title' and the text 'Think Programming'"
  }],
  "cssQuestions": [{
    "title": "css Question1",
    "question": "this is css Question1. this is css Question1, this is css Question1"
  },
  {
    "title": "css Question2",
    "question": "this is css Question2. this is css Question2. this is css Question2."
  },
  {
    "title": "css Question3",
    "question": "this is css Question3. this is css Question3. this is css Question3."
  }],
  "dsaQuestions": [{
    "title": "DSA Question 1",
    "question": "This is the first DSA Question. This is the first DSA Question. This is the first DSA Question. "
  },
  {
    "title": "DSA Question 2",
    "question": "This is the second DSA Question. This is the second DSA Question. This is the second DSA Question. "
  }, 
  {
    "title": "DSA Question 3",
    "question": "This is the third DSA Question. This is the third DSA Question. This is the third DSA Question. "
  }]
}